//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 1 ***                      //
//                                                                            //
// Файл Distance.cpp                                                          //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#include "Distance.h"


double Distance(Point3D p1, Point3D p2)
{
  float dX = (p1.X-p2.X)*(p1.X-p2.X);
  float dY = (p1.Y-p2.Y)*(p1.Y-p2.Y);
  float dZ = (p1.Z-p2.Z)*(p1.Z-p2.Z);

  double res = sqrt(static_cast<double>(dX+dY+dZ));
  return res;
}
