//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 1 ***                      //
//                                                                            //
// Файл Distance.h                                                            //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#ifndef DISTANCE_H
#define DISTANCE_H

#include <math.h>


struct Point3D
{
  float X;
  float Y;
  float Z;
};


//Вычисление расстояния между двумя точками в трехмерном пространстве
double Distance(Point3D p1, Point3D p2);


#endif
