//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 1 ***                      //
//                                                                            //
// Файл EvenNumber.cpp                                                        //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#include "EvenNumber.h"


int EvenNumber(TArrNumber Arr, int Value)
{
  int sum=0;

  for(unsigned int i=0; i<Arr.size(); i++)
  {
    if ((Arr[i] % 2) == 0)
    {  //Число четное
      sum = sum + Arr[i];
    }

    if (Arr[i] == Value)
      break;
  }
  return sum;
}
