//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 1 ***                      //
//                                                                            //
// Файл Factorial.h                                                           //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#ifndef FACTORIAL_H
#define FACTORIAL_H

#include <math.h>


//Вычисление факториала числа (рекурсивная функция)
double Factorial(int n);


#endif
