//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 1 ***                      //
//                                                                            //
// Файл Factorial.cpp                                                         //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#include "Factorial.h"


double Factorial(int n)
{
  if (n == 0) return 0.0;
  if (n == 1) return 1.0;
  else return (static_cast<double>(static_cast<double>(n)*Factorial(n-1)));
}
