//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 1 ***                      //
//                                                                            //
// Файл FindNumber.h                                                          //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#ifndef FINDNUMBER_H
#define FINDNUMBER_H

#include <QString>
#include "EvenNumber.h"


//Поиск целых чисел в строке
TArrNumber FindNumber(QString str);


#endif
