//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 1 ***                      //
//                                                                            //
// Файл GeometricMean.h                                                       //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#ifndef GEOMETRICMEAN_H
#define GEOMETRICMEAN_H

#include <math.h>


//Среднее геометрическое трех чисел
double GeometricMean(double A, double B, double C);


#endif
