//----------------------------------------------------------------------------//
//                       *** ЛАБОРАТОРНАЯ РАБОТА № 1 ***                      //
//                                                                            //
// Файл OtherFunc.h                                                           //
//                                                                            //
// Автор ГЛУЩЕНКО Сергей Юрьевич                                              //
//                                                                            //
//                                                   Москва, НИИ ТП, 2023 год //
//----------------------------------------------------------------------------//


#ifndef OTHERFUNC_H
#define OTHERFUNC_H

#include <QString>


//Исключение из результирующей строки символов, заключенных в круглые скобки
QString xxx(QString s);


//Преобразование строки по типу: буквы на четных позициях - в верхний регистр,
// буквы на нечетных позициях - в нижний регистр
QString yyy(QString s);


#endif
